var DefaultPoem = [
"夏目漱石", "山路觀楓", "石苔沐雨滑難攀 渡水穿林往又還 處處鹿聲尋不得 白雲紅葉滿千山"
// 明治22年11月6日 第一高等中學校（大學豫備門）在籍中22才の作
];

var POEMS = [
{ "中国古代" : {
"詩經" : {
"桃夭" : "桃之夭夭灼灼其華 之子于歸宜其室家 桃之夭夭有蕡其實 之子于歸宜其家室 桃之夭夭其葉蓁蓁 之子于歸宜其家人",
"關雎" : "關關雎鳩在河之洲 窈窕淑女君子好逑 參差荇菜左右流之 窈窕淑女寤寐求之 求之不得寤寐思服 悠哉悠哉輾轉反側 參差荇菜左右采之 窈窕淑女琴瑟友之 參差荇菜左右芼之 窈窕淑女鐘鼓樂之",
"鶴鳴" : "鶴鳴于九皋 聲聞于野 魚潛在淵 或在于渚 樂彼之園 爰有樹檀 其下維蘀 它山之石 可以為錯 鶴鳴于九皋 聲聞于天 魚在于渚 或潛在淵 樂彼之園 爰有樹檀 其下維榖 它山之石 可以攻玉" },
"陶淵明" : { // 365 - 427
"飮酒" : "結盧在人境 而無車馬喧 問君何能爾 心遠地自偏 采菊東籬下 悠然見南山 山氣日夕佳 飛鳥相與還 此中有眞意 慾辯已忘言" }
}},

{"唐" : {
"王之渙" : { // 688 - 742
"登鸛雀樓" : "白日依山盡 黃河入海流 慾窮千里目 更上一層樓" },

"孟浩然" : { // 689 - 740
"春曉" : "春眠不覺曉 處處聞啼鳥 夜來風雨聲 花落知多少",
"勸酒" : "勸君金屈卮 滿酌不須辭 花發多風雨 人生足別離",
"洛中訪袁拾遺不遇" : "洛陽訪才子 江嶺作流人 聞說梅花早 何如此地春" },

"李白" : { // 701 - 762
"越中懷古" : "越中句踐破吳歸 義士還家盡錦衣 宮女如花滿春殿 只今惟有鷓鴣飛",
"靜夜思" : "牀前看月光 疑是地上霜 擧頭望山月 低頭思故鄕",
"黃鶴樓送孟浩然之廣陵" : "故人西辭黃鶴樓 煙花三月下揚州 孤帆遠影碧空盡 惟見長江天際流",
"登金陵鳳凰臺":"鳳凰臺上鳳凰遊 鳳去臺空江自流 吳宮花草埋幽徑 晉代衣冠成古丘 三山半茖靑天外 二水中分白鷺洲 總爲浮雲能蔽日 長安不見使人愁",
"下終南山遇斛斯山人宿置酒":"暮從碧山下 山月隨人歸 卻顧所來徑 蒼蒼橫翠微 相攜及田家 童稚開荊扉 綠竹入幽徑 靑蘿拂行衣 歡言得所憩 美酒聊共揮 長歌吟松風 曲盡河星稀 我醉君復樂 陶然共忘機",
"月下獨酌":"花閒一壺酒 獨酌無相親 舉杯邀明月 對影成三人 月既不解飮 影徒隨我身 暫伴月將影 行樂須及春 我歌月徘徊 我舞影零亂 醒時同交歡 醉後各分散 永結無情遊 相期邈雲漢",
"春思":"燕草如碧絲 秦桑低綠枝 當君懷歸日 是妾斷腸時 春風不相識 何事入羅幃",
"關山月":"明月出天山 蒼茫雲海閒 長風幾萬里 吹度玉門關 漢下白登道 胡窺靑海灣 由來征戰地 不見有人還 戍客望邊色 思歸多苦顏 高樓當此夜 歎息未應閒",
"子夜四時歌春歌":"秦地羅敷女 採桑綠水邊 素手靑條上 紅妝白日鮮 蠶饑妾慾去 五馬莫留連",
"怨情":"美人捲珠簾 深坐顰蛾眉 但見淚痕濕 不知心恨誰",
"贈孟浩然":"吾愛孟夫子 風流天下聞 紅顏棄軒冕 白首臥松雲 醉月頻中聖 迷花不事君 高山安可仰 徒此挹淸芬" },

"王維" : { // 701 - 761
"送祕書晁監還日本國" : "積水不可極 安知滄海東 九州何處遠 萬里若乘空 向國惟看日 歸帆但信風 鰲身映天黑 魚眼射波紅 鄕樹扶桑外 主人孤島中 別離方異域 音信若爲通",
"鹿柴" : "空山不見人 但聞人語響 返景入深林 復照靑苔上",
"竹里館" : "獨坐幽篁裏 彈琴復長嘯 深林人不知 明月來相照",
"送別" : "下馬飮君酒 問君何所之 君言不得意 歸臥南山陲 但去莫復問 白雲無盡時",
"酌酒與裴迪" : "酌酒與君君自寬　人情飜覆似波瀾　白首相知猶按劍　朱門先達笑彈冠　草色全經細雨濕　花枝慾動春風寒　世事浮雲何足問　不如高臥且加餐",
"送元二使安西" : "渭城朝雨浥輕塵 客舍靑靑柳色新 勸君更盡一杯酒 西出陽關無故人" },

"杜甫" : { // 712 - 770
"春望" : "國破山河在 城春草木深 感時花濺淚 恨別鳥驚心 烽火連三月 家書抵萬金 白頭搔更短 渾慾不勝簪",
"淸明" : "淸明時節雨粉粉 路上行人慾斷魂 借問酒家何處在 牧童遙指杏花村",
"山行" : "遠上寒山石徑斜 白雲生處有人家 停車坐愛楓林晚 霜葉紅於二月花" },

"岑参" : { // 715 - 770
"磧中作" : "走馬西來慾到天 辭家見月兩回圓 今夜不知何處宿 平沙萬里絕人煙" },

"張籍" : { // 766? - 830?
"秋思" : "洛陽城裏見秋風 慾作家書意萬重 復恐怱怱說不盡 行人臨發又開封" },

"薛濤" : { // 768 - 831
"春望" : "花開不同賞 花落不同悲 慾問相思處 花開花落時" },

"王翰" : {
"涼州詞" : "葡萄美酒夜光杯 慾飮琵琶馬上催 醉臥沙場君莫笑 古來征戰幾人回",
"涼州詞" : "秦中花鳥已應闌 塞外風沙猶自寒 夜聽胡笳折楊柳 敎人意氣憶長安" },

"高適" : { // -765
"除夜作" : "旅館寒燈獨不眠 客心何事轉凄然 故鄕今夜思千里 霜鬢明朝又一年",
"別董大" : "十里黃雲白日大 北風吹雁雪紛紛 莫愁前路無知己 天下誰人不識君" },

"白居易" : { // 772 - 846
"對酒" : "蝸牛角上爭何事 石火光中寄子此身 隨富隨貧且歡樂 不開口笑是癡人",
"偶題東壁" : "日高睡足猶慵起 小閤重衾不怕寒 遺愛寺鐘欹枕聽 香鑪峯雪撥簾看 匡廬便是逃名地 司馬仍爲送老官 心泰身寧是歸處 故鄕可獨在長安" },

"劉禹錫" : { // 772 - 842
"秋風引" : "何處秋風至 蕭蕭送雁羣 朝來入庭樹 孤客最先聞",
"楊柳枝詞" : "煬帝行宮汴水濱 數枝楊柳不勝春 晚來風起花如雪 飛入宮牆不見人",
"元和十一年自朗州召至京戲贈看花諸君子" : "紫陌紅塵拂面來 無人不道看花回 玄都觀裏桃千樹 盡是劉郞去後栽" },

"柳宗元" : { // 773 - 819
"江雪" : "千山鳥飛絕 萬徑人蹤滅 孤舟簑笠翁 獨釣寒江雪" },

"賈島" : { // 779 - 843
"尋隱者不遇" : "松下問童子 言師採藥去 只在此山中 雲深不知處",
"劍客" : "十年磨一劍 霜刄未曾試 今日把似君 誰爲不平事" },

"李紳" : { // 780? - 846
"憫農" : "春種一粒粟 秋成萬顆子 四海無閒田 農夫猶餓死 鋤禾日當午 汗滴禾下土 誰知盤中餐 粒粒皆辛苦" },

"杜牧" : { // 803 - 853
"江南春" : "千里鶯啼綠映紅 水村山郭酒旗風 南朝四百八十寺 多少樓臺煙雨中",
"遣懷" : "落魄江湖載酒行 楚腰纖細掌中輕 十年一覺揚州夢 贏得靑樓薄倖名",
"過淸華宮" : "長安回望繡成堆 山頂千門次第開 一騎紅塵妃子笑 無人知是荔枝來",
"寄揚州韓綽判官" : "靑山隱隱水遙遙 秋盡江南草木凋 二十四橋明月夜 玉人何處敎吹簫",
"遣懷" : "落魄江南載酒行 楚腰腸斷掌中輕 十年一覺揚州夢 贏得靑樓薄倖名" },

"于武陵" : { // 810 - 
"勸酒" : "勸君金屈巵 滿酌不須辭 花發多風雨 人生足別離" },

"李商隠" : { // 812 - 858
"嫦娥" : "雲母屏風燭影深 長河漸落曉星沈 嫦娥應悔偸靈藥 碧海靑天夜夜心" },

"曹松" : { // 830? - 901?
"己亥歲" : "澤國江山入戰圖 生民何計樂樵蘇 憑君莫話封侯事 一將功成萬骨枯" },

"高駢" : { // - 887
"山亭夏日" : "綠樹陰濃夏日長 樓臺倒影入池塘 水晶簾動微風起 一架薔薇滿院香" },

"魚玄機" : { // 843 - 871?
"秋愁" : "自歎多情是足愁 況當風月滿庭秋 洞房偏與更聲近 夜夜燈前慾白頭" },

"朱淑眞" : {
"減字木蘭花" : "獨行獨坐 獨唱獨酬還獨臥 佇立傷神 無奈輕寒著摸人 此情誰見 淚洗殘妝無一半 愁病相仍 剔盡寒燈夢不成" } ,

"太上隱者" : {
"答人" : "偶來松樹下 高枕石頭眠 山中無曆日 寒盡不知年" }
}},

{ "宋元" : {
"王安石" : { // 1021 - 1086
"梅花" : "牆角數枝梅 凌寒獨自開 遙知不是雪 爲有暗香來" },

"蘇軾" : { // 1037 - 1101
"春夜" : "春宵一刻直千金 花有淸香月有陰 歌管樓臺聲細細 鞦韆院落夜沈沈",
"飮湖上初晴後雨" : "水光瀲灩晴偏好 山色空濛雨亦奇 慾把西湖比西子 淡粧濃抹總相宜" }
}},

{ "明清" : {
"劉基" : { // 1311 - 1375
"無題" : "人生無百歲 百歲復如何 古來英雄士 各已歸山阿",
"無題2" : "秋夜月黃金波 照人哭照人歌 人歌人哭月長好 月缺月圓人自老",
"題小書" : "庭前綠荷叶 香氣濃于酒 疎雨忽飛來 的礫明珠走",
"題畫猫" : "碧眼烏圓食有魚 仰看胡蝶坐階除 春風漾漾吹花影 一任東郊鼠化鴽",
"孤雲獨去閑" : "風驅急雨酒高城 雲壓輕雷殷地聲 雨過不知龍去處 一池草色萬蛙鳴" },

"王陽明" : { // 1472 - 1529
"睡起偶成" : "四十餘年睡夢中 而今醒眼始朦朧 不知日已過卓午 起向高樓撞曉鐘" }
}},

{"中国近現代" : {
"康有為" : { // 1858 - 1927
"免恨京三詠之一" : "啤酒尤傳免恨名 創於湃認路易傾 吾曾入飮王酒店 三千人醉飮如鯨" },

"毛澤東" : { // 1949 - 1976
"人民解放軍占領南京" : "鍾山風雨起蒼黃 百萬雄師過大江 虎踞龍盤今勝昔 天飜地覆慨而慷 宜將剩勇追窮寇 不可沽名學霸王 天若有情天亦老 人閒正道是滄桑" }
}},

{"飛鳥時代" : {}},

{"奈良時代" : {
"阿倍仲麻呂" : {// 698 - 770
"望月望鄕" : "翹首望東天 神馳奈良邊 三笠山頂上 想又皓月圓" },

"大伴家持" : { // 718? - 785
"七言晚春三日遊覽一首" : "餘春媚日宜怜賞 上巳風光足覽遊　柳陌臨江縟袨服　桃源通海泛仙舟　雲罍酌桂三淸湛　羽爵催人九曲流　縱醉陶心忘彼我　酩酊無處不淹留" }
}},

{"平安時代" : {
"嵯峨天皇" : {// 786 - 842
"春日遊獵日暮宿江頭亭子" : "三春出獵重城外 四望江山勢轉雄 逐兎馬蹄承落日 追禽鷹翮拂輕風 征舟暮入連天水 明月孤懸慾曉空 不學夏王荒此事 爲思周卜偶非熊" },

"菅原道眞" : { // 845 - 903
"九月十日" : "去年今夜侍淸涼 秋思詩篇獨斷腸 恩賜御衣今在此 捧持每日拜餘香",
"自詠" : "離家三四月 落淚百千行 萬事皆如夢 時時仰彼蒼" }
}},

{"鎌倉時代" : {
"道元" : { // 1200 - 1253
"山居" : "西來祖道我傳東 鉤月耕雲慕古風 世俗紅塵飛不到 深山雪夜草菴中" },

"北条時頼" : { // 1227 - 1263
"春流" : "春流高以岸 細草碧於苔 小院無人到 風來門自開" },

"細川頼之" : { // 1329 - 1392
"海南行" : "人生五十愧無功 花木春過夏已中 滿室蒼蠅掃難去 起尋禪榻臥淸風" }
}},

{"室町時代" : {}},

{"安土桃山時代" : {
"武田信玄" : { // 1521 - 1573
"惜落花" : "檐外紅殘三四峰 蜂狂蝶醉景猶濃 遊人亦借漁翁手 網住飛花至晚鐘" },

"上杉謙信" : { // 1530 - 1578
"九月十三夜" : "霜滿軍營秋氣淸 數行過雁月三更 越山倂得能州景 遮莫家鄕憶遠征" },

"明智光秀" : { // - 1582
"辭世" : "順逆無二門 大道徹心源 五十五年夢 覺來歸一元"},

"藤原惺窩" : { // 1561 - 1619
"山居" : "靑山高聳白雲邊 仄聽樵歌忘世緣 意足不求絲竹樂 幽禽睡熟碧巖前" },

"伊達政宗" : { // 1567 - 1636
"醉餘口號" : "四十年前少壯時 功名聊復自私期 老來不識干戈事 只把春風桃李巵" }
}},

{"江戸時代" : {
"林羅山" : { // 1583 - 1657
"武野晴月" : "武陵秋色月嬋娟 曠野平原晴快然 輾破靑靑無轍迹 一輪千里草連天" },

"山崎闇斎" : { // 1619 - 1682
"仲秋主靜齋卽興" : "酷憐名月浮庭露 箇箇圓成太極圖 茂叔何人我何者 只輸他主靜功夫" },

"木下順庵" : { // 1621 - 1699
"豐臣廟感懷奉和尺五先生韻" : "松下行厨豐廟邊 登臨轉感艷陽天 鄴臺人去荊蓁合 驪岫雲還陵谷遷 殘樹空榮荒逕裏 餘香暗度晚風前 年年惟有花時節 醉無狂歌翠幕連" },

"安東省庵" : { // 1622 - 1701
"偶成" : "平生難寢又難起 懶卻人閒夢寐中 一事無成老將至 衡門獨立目冥鴻" },

"日政" : { // 1623 - 1668
"病來" : "夢裡鳴鳩林日閒 滿堂無客晝如年 一生多病是何幸 白髮殘僧傍母眠" },

"徳川光圀" : { // 1628 - 1701
"荻花" : "荻上瀼瀼白露淸 白花相映月光明 風吹黃葉發天籟 轉作潯陽瑟瑟聲",
"觀農夫治田":"奚掊民膏喜有年 朝耘夕耨沒安眠 竊玄翼濕一犂雨 布谷聲幽千畝煙 頂笠披蓑丘壟下 腰鐮飽饁夕陽邊 君看稼不農而已 在殖心苗肥學田" },

"伊藤仁齋" : { // 1627 - 1705
"冬夜卽事" : "無求無責一閒人 机上漫書草又眞 呼取蛤蜊對歡伯 更添爐底小烏銀" },

"後光明天皇" : { // 1633 - 1654
"四方拜" : "霜滿雲階天未曙 畫屏銀燭照中庭 當時曾自幸河上 千載綿綿禮七星" },

"人見竹洞" : { // 1638 - 1696
"卽興" : "柴火淸茶手自煎 松風寒雨坐蕭然 把書偶有味深意 不覺猫兒上膝眠" },

"新井白石" : { // 1657 - 1725
"自題肖像" : "蒼顏如鐵鬢如銀 紫石稜稜電射入 五尺小身渾是膽 明時何用畫麒麟",
"送入京人" : "紅亭綠酒畫橋西 柳葉靑靑送馬蹄 君到長安花自老 春山一路杜鵑啼",
"卽事" : "靑山初已曙 鳥雀出林鳴 稚竹煙中上 孤花露下明 煎茶雲繞榻 梳髮雪垂纓 偶坐無公事 東窗待日生",
"春日作" : "楊柳花飛江水流 王孫草色遍芳洲 金罍美酒葡萄綠 不醉靑春不解愁",
"芳草原" : "春入芳原上 靑靑襯步鞋 佳人來鬭草 應賭鳳凰釵",
"戯詠西瓜" : "西域分奇種 東門學故侯 黃花鵞毳細 靑蔓蝶鬚勾 實大如金斗 形圓似翠毬 綺筵紅慾下 玉斧月應修 齧作蘇卿雪 漱成孫楚流 鮮紅凝血色 似飮月支頭",
"稻村崎":"金鼓振天從北藩 驚沙濺血日光昏 寶刀沈水神龍化 碧海揚塵汗馬奔 九代衣冠餘戰骨 千年星月照冤魂 滿江巨艦眞閑事 據舊寒潮落遠邨" },

"荻生徂徠" : { // 1666 - 1728
"東都四時楽1" : "東叡山頭花似氛 東叡山下雪紛紛 笙歌千隊齊聲唱 那得暫時停白雲",
"東都四時楽2" : "兩國橋邊動櫂歌 江風涼月水微波 怪來岸上人聲寂 恰是扁舟仙女過",
"還館口號" : "甲陽美酒綠葡萄 霜露三更濕客袍 須識良宵天下少 芙蓉峰上一輪高" },

"武林唯七" : { // 1672 - 1703
"無題" : "三十年來一夢中 捨生取義幾人同 家鄕臥病雙親在 膝下奉歡恨不終" },

"太宰春台" : { // 1680 - 1747
"寧樂懷古" : "南土茫茫古帝城 三條九陌自縱橫 籍田麥秀農人度 馳道蓬生賈客行 細柳低垂常惹恨 閑花歷亂竟無情 千年陳迹唯蘭若 日暮呦呦野鹿鳴",
"稻叢懷古" : "沙汀南望浩煙波 聞說三軍自此過 潮水歸來人事改 空山迢遞夕陽多",
"登白雲山" : "白雲山上白雲飛 幾戶人家倚翠微 行盡白雲雲裡路 滿身還帶白雲歸" } ,

"江村北海" : {// 1713 - 1788
"有感" : "小蟹生江浦 營穴蘆岸下 穴中不盈寸 自以爲大廈 朝慮沙岸崩 夕怕江潮瀉 物小識亦微 營營何爲者",
"九月十二日攝河道中" : "城外多幽事 況過搖落天 機聲村巷裏 帘影野橋前 哀怨雙池水 逢迎一屋烟 小尨頻掉尾 曾宿未經年",
"夏川" : "河上烟嵐疊碧紗 南風吹動水紋斜 夕陽纔斂飛螢亂 卻勝春流泛落花" },

"本居宣長" : { // 1730 - 1801
"春日早朝" : "鷄鳴九陌報淸晨 初日纔昇映紫宸 金殿出霞花氣暖 玉樓經雨柳條新 羣臣集奏千秋壽 蠻客貢陳四海珍 且識天杯元承露 聖明恩澤更含春",
"讀書" : "獨坐閒窗下 讀書慾曉星 孜孜何須睡 一任醉羣經",
"上巳" : "元巳春風暖 桃花照錦筵 麗人更勸醉 流水羽觴前" },

"亀井南冥" : { // 1743 - 1814
"雨後看月" : "驟雨過城雲尚懸 何來皎月照林泉 芙渠地上風難定 葉葉明珠琢未圓" },

"赤松蘭室" : { // 1743 - 1797
"旅館聽雨" : "孤劍天涯客 況逢秋色深 寒窗聽雨夕 遠道憶人心 淅瀝芭蕉老 凄涼蟋蟀沈 終宵夢不就 撫枕又長吟" },

"菅茶山" : { // 1748 - 1827
"江戶邸舍臥病" : "閑窗日對藥爐烟 不那韶華病裡遷 都門樂事春多少 時見風箏泝半天" },

"大田南畝" : { // 1749 - 1823
"望嶽" : "日出扶桑海氣重　靑天白雪秀芙蓉　誰知五嶽三山外　別有東方不二峰",
"自遣":"少年高志在千秋 大業無成日月流 漸與梁園詞客絕 轉隨燕市酒人遊 送迎曾掛南州榻 唱和空傳下里謳 莫道吏情難免俗 有時飛夢到滄洲" },

"亀田鵬斎" : { // 1752 - 1826
"戊申除夕" : "腐儒亦奔走 酒債更難賖 一穀五窮具 寸心千慮加 家貧妻慣苦 志壯兒知誇 明歲有何事 夜深笑燈花",
"酔後漫吟" : "蓬萊曾侍群仙宴 醉罵金丹換骨迂 王母怒加我嚴譴 謫降塵世作狂夫",
"無官" : "無官身無縛 無縛心不競 生來天許閒 此閒卽吾命",
"撫剣1" : "大坐撫名劍 霜光凜慾飛 不愁無所用 祇恨識者稀",
"撫剣2" : "不慾與世乖 奈何與時違 獨撫腰閒劍 潸然淚沾衣",
"帰田作" : "模索前塗暗如漆 須悟窮達不可必 放歌痛飮莫長嗟 半生五十人事畢",
"辛巳元旦" : "朝來多感七旬時 總異少年心所期 身老自知性益急 氣衰偏愧志逾卑 往事夢逐風雲駃 新歲興隨犬馬遲 春酒三盃題門帖 田閒自在聽黃鸝",
"老大" : "老大智進解何事 追想往事皆兒戲 今日認眞明日無 須將心情付酣醉"
},

"良寛" : { // 1758 - 1831
"無題" : "孰謂我詩詩 我詩非是詩 知我詩非詩 始可與言詩",
"無題2" : "可憐好丈夫 閑居好題詩 古風擬漢魏 近體唐作師 斐然其爲章 加之以新奇 不寫心中物 雖多復何爲" },

"多田季婉" : {
"暮春有感" : "憔悴花前自恨春 花開花落白頭新 顛狂柳絮今相似 昔日深窗詠雪人" },

"頼山陽" : { // 1781 - 1832
"長崎謠" : "扇洲樓下盪槳遲 碧檻紅燈閃玉卮 試倚船窗呼姊妹 認他夜宴侍胡兒",
"題不識庵擊機山圖" : "鞭聲肅肅夜過河 曉見千兵擁大牙 遺恨十年磨一劍 流星光底逸長蛇",
"舟發大垣赴桑名" : "蘇水遙遙入海流 櫓聲雁語帶鄕愁 獨在天涯年慾暮 一蓬風雪下濃州",
"八幡公" : "結髮從軍弓箭雄 八州草木識威風 白旗不動兵營靜 立馬邊城看亂鴻",
"新居" : "新居逢元日 推戶晴㬢明 階下淺水流 涓涓已春聲 臨流洗我硏 硏紫映山靑 地僻少賀客 自喜省送迎 棲息有如此 足以愜素情 所恨唯一母 迎養志未成 安得共此酒 慈顏一咲傾 磨墨作鄕書 醉字易縱橫",
"患結核戲作歌" : "吾有一腔血 其色正赤其性熱 不能瀝之明主前 赤光凜向廟堂徹 亦不能濺之國家難 留痕大地碧弗滅 鬱積徒成磊塊凝 慾吐不吐中逾熱 一旦喀出學李賀 難收糝地紅玉屑 或曰先生閱史遭姦雄逭天罰 睢陽之齒輒嚼齧 渠無寸傷己自殘 憤懣遂致肺肝裂 或曰先生殺人手無銕 發奸擿伏由筆舌 以心誅心人不知 靈臺冥冥瀦陰血 吾聞此語兩未頷 童子進曰走意別 先生肉中本無血 腹中奇字僅可剟 賺得杜康爭戴酒 劍菱如劍嶽雪雪 大福藏府受不起 溢爲赤漦戒饕餮 咄哉此意愼勿說",
"兵兒謠" : "衣至骭 袖至腕 腰閒秋水鐵可斷 人觸斬人 馬觸斬馬 十八結交健兒社 北客能來何以酬 彈丸硝藥是膳羞 客猶不屬饜 好以寶刀加渠頭 蕉衫如雪不愛塵 長袖緩帶學都人 怪來健兒語音好 一操南音官長瞋 蜂黃落　蝶粉褪 倡優巧　鐵劍鈍 以馬換妾髀生肉 眉斧解剖壯士腹",
"癸丑歲偶作" : "十有三春秋 逝者已如水 天地無始終 人生有生死 安得類古人 千載列靑史" },

"大塩平八郎" : { // 1793 - 1837
"無題" : "春曉城中春睡衆 遶檐燕雀聲虛哢 非上高樓撞巨鐘 桑楡日暮猶昏夢",
"四十七士" : "臥薪嘗膽幾辛酸 一夜劍光映雪寒 四十七碑猶護主 凜然冷殺奸臣肝" },

"徳川斉昭" : { // 1800 - 1860
"水戶八景": "雪時嘗賞仙湖景 雨夜更遊靑柳頭 山寺晚鐘響幽壑 太田落雁渡芳洲 花光爛漫岩船夕 月色玲瓏廣浦秋 遙望村松靑嵐後 水門歸帆映高樓" },

"佐久間象山" : { // 1811 - 1864
"暮春囑目" : "櫻花三月滿皇州 曉起倚樓凝遠眸 慾撫獨絃歌一曲 白雲散漫四山頭" },

"鍋島直正" : { // 1815 - 1871
"無題" : "孤島結團意氣豪 西南決眥萬重濤 黠奴若有窺邊事 羶血飽膏日本刀" },

"朱子？" : {
"無題": "少年易老學難成 一寸光陰不可輕 未覺池塘春草夢 階前梧葉已秋聲" }
}},

{ "幕末維新" : {
"元田永孚" : { // 1818 - 1891
"中庸" : "勇力男兒斃勇力 文明才子醉文明 勸君須擇中庸去 天下萬機歸一誠" },

"勝海舟" : {  // 1823 - 1899
"無題" : "誰敎大鼎弄羣兒 只見蒼生苦荊岐 嗚呼吾主高義家 如何憤怨及我私 古往今來已如此 上下千年任天知 壯士決戰不顧死 此際豈亦容毀誓 錦旗飜風函嶺巔 湯城殺氣紊綱紀 丈夫報恩他有需 救此蒼生答天子" },

"頼三樹三郎" : { // 1825 - 1859
"無題" : "山靑殘月薄 燈白古邨寒 橋霜人未過 滿耳水珊珊",
"無題2" : "海月淸風靜 金波澹不流 無人賞此景 一擲付漁舟",
"過凾嶺" : "當年意氣慾凌雲 快馬東馳不見山 今日危途春雨冷 檻車搖夢過函關" },

"山内容堂" : { // 1827 - 1872
"亢龍喪元" : "亢龍喪元櫻花門 敗鱗散與飛雪飜 腥血如河雪亦赤 乃祖赤裝勇無存 汝到地獄成佛否 萬頃淡海付犬豚" },

"西郷隆盛" : { // 1828 - 1877
"無題" : "幾歷辛酸志始堅 丈夫玉碎愧磚全 一家遺事人知否 不爲兒孫買美田",
"無題2" : "大聲呼酒坐高樓 豪氣將呑五大州 一寸丹心三尺劍 握拳先試佞人頭",
"無題3" : "一貫唯唯諾 從來鐵石肝 貧居生傑士 勳業顯多難 耐雪梅花麗 經霜楓葉丹 如能識天意 豈敢自謀安",
"溫泉卽興" : "幽居夢覺起茶烟 靈境溫泉洗世緣 地僻山深靜盡夜 不聞人語只看天" },

"武市半平太" : { // 1829 - 1865
"夢覺而得一絕" : "夢上洛陽謀故人 終衝巨奸氣逾振 覺來浸汗恨無限 只聽鄰鷄報早晨" },

"吉田松陰" : { // 1830 - 1859
"辭世" : "吾今爲國死 死不背君親 悠悠天地事 鑑照在明神" },

"大久保利通" : { // 1830 - 1878
"下通州偶成" : "奉敕單航向北京 黑煙堆裏蹴波行 和成忽下通州水 閑臥篷窗夢自平" },

"橋本左内" : { // 1834 - 1859
"獄中作" : "二十六年夢裡過 顧思平昔感滋多 天祥大節嘗心折 土室猶吟正氣歌" },

"近藤勇": { // 1834 - 1868
"作感懷" : "富貴利名豈可羨　悠悠官路任浮沈 此身更有苦辛在　飽食暖衣非我心",
"讀外史" : "摩挲源將木人形 自說盛功爾我儔 猶有一般優劣處 鉞矛他日凌明州",
"笑艸" : "丈夫立志出東關 宿願無成不復還 報國盡忠三尺劍 十年磨而在腰閒",
"無題" : "負恩守義皇州士 一志傳手入洛陽 晝夜兵談作何事 攘夷誰斗布衣郞",
"無題2" : "曾聞蠻貊稱五臣 今見虎狼候我津 回復誰尋神后趾 向來愼莫用和親",
"無題3" : "百行所依孝與忠 取之無失果英雄 英雄縱不吾曹事 慾以赤心攘羌戎",
"有感作" : "只應晦迹寓牆東 喋喋何隨世俗同 果識英雄心上事 不英雄處是英雄",
"無題4" : "孤軍援絕作囚俘 顧念君恩淚更流 一片丹衷能殉節 雎陽千古是吾儔",
"無題5" : "靡他今日復何言 取義捨生吾所尊 快受電光三尺劍 只將一死報君恩" },

"成島柳北" : { // 1837 - 1884
"夏夜" : "雨餘樹色淸如沐 蒲扇葛巾涼可掬 翠柳街頭月半稜 兒童相伴呼蝙蝠",
"歲晚書感" : "雪華幾寸沒新阡 側枕中宵獨慘然 百難侵身身未死 又偕窮鬼餞徂年",
"巴里" : "十載夢飛巴里城 城中今日試閑行 畫樓涵影淪綺水 士女如花簇晚晴",
"夏夜" : "婦子朝來掃甑塵 蕭條破屋又新春 賣書賣劍家貲盡 幸是先生未賣身" },

"佐野竹之介" : { // 1839 - 1860
"出鄕作" : "決然去國向天涯 生別又兼死別時 弟妹不知阿兄志 慇懃牽袖問歸期" },

"高杉晋作" : { // 1839 - 1867
"題焦心錄後" : "內憂外患迫吾州 正是危急存亡秋 唯爲邦君爲邦國 降彈名姓又何愁" }
}},

{"明治" : {
"伊藤博文" : { // 1841 - 1909
"奉命巡視琉球" : "六隻艨艟旗色雄 鵬程萬里駕長風 誰知軍國邊防策 辛苦經營方寸中",
"飮某樓" : "豪氣堂堂橫大空 日東誰使帝威隆 高樓傾盡三杯酒 天下英雄在眼中" },

"陸奧宗光" : { // 1844 - 1897
"無題" : "朝踊暮吟十五年 飄身漂泊似難船 他時爭得生鵬翼 一擧排雲翔九天" },

"中江兆民" : { // 1847 - 1901
"病中得二首之一" : "殘燈吹燄已 涼月半窗明 病客夢方覺 陰蟲三五鳴" },

"乃木希典" : { // 1849 - 1912
"金州城下作" : "山川草木轉荒涼 十里風腥新戰場 征馬不前人不語 金州城外立斜陽",
"富嶽" : "崚嶒富嶽聳千秋 赫灼朝暉照八洲 休說區區風物美 地靈人傑是神州",
"爾靈山" : "爾靈山𡸴豈難攀 男子功名期克艱 鐵血覆山山形改 萬人齊仰爾靈山" },

"森鴎外" : { // 1862 - 1922
"香港" : "開釁當年事悠悠 滄桑之變喜還愁 誰圖莽草荒煙地 附與英人泊萬船",
"待春" : "南廂偶坐惱沈吟 目送凍禽鳴出林 唯喜簾前風稍暖 待花心是待春心",
"路易二世" : "當年向背駭羣臣 末路悽愴泣鬼神 功業千秋且休問 多情偏是愛詩人" },

"徳富蘇峰": { // 1863 - 1957
"兩英雄" : "堂堂錦旆壓關東 百萬死生談笑中 羣小不知天下計 千秋相對兩英雄",
"京都東山" : "三十六峰雲漠漠 洛中洛外雨紛紛 破簦短褐來揮淚 秋冷殉難烈士墳" },

"幸田露伴" : {  // 1867 - 1947
"題富士山圖" : "白雲爲帶雪爲冠 屹立紫霄對翠瀾 應是神州靈氣發 成山四海萬民觀" },

"正岡子規" : { // 1867 - 1902
"雨閒惜花" : "花園煙雨裡 閑坐獨題詩 終日無朋到 亦無啼鳥窺",
"午睡" : "南風萬里亂鳴蝉 夏日日長催午眠 慾貧淸涼移枕箪 晚來夢覺興悠然",
"觀博覽會" : "如今自恥異邦傳 萬有奇珍集眼前 知是人閒開化具 古書古畫百千年",
"天長節" : "節入深秋露氣淸 正逢聖誕酒頻傾 坐知億兆蒙王化 戶戶旭旗表太平",
"送增田君赴鎭臺" : "男子誰無報國情 團欒相話酒壺傾 離筵今日把杯手 他日指揮幾萬兵",
"自題寫眞" : "一幅寫眞鏡影同 如瞋如笑亦如聾 麞頭鼠目野人相 廉潔自呼小陶叟 蠢迂未免舊阿蒙 榮官高位非吾願 不要留名麟閣中",
"似笑天道士" : "眞理無涯豈易窮 一生消費苦慮中 支頤漸悟物心一 閉眼便知天地空 縱令廊廟鹿欺馬 焉容人世異爲同 名奔利走眞堪笑 獨喚烏烏氣更雄",
"送夏目漱石之伊豫" : "去矣三千里 送君生暮寒 空中懸大嶽 海末起長瀾 僻地交友少 狡兒敎化難 淸明期再會 莫後晚花殘" },

"夏目漱石" : { // 1867 - 1916
"鴻臺1" : "鴻臺冒曉訪禪扉 孤磬沈沈斷續微 一叩一推人不答 驚鴉撩亂掠門飛",
"鴻臺2" : "高刹聳天無一物 伽藍半破長松鬱 當年遺蹟有誰探 蛛網何心牀古佛",
// 明治22年9月9日脱稿『木屑録』
"自東金至銚子途上口號" : "風行空際亂雲飛 雨鎖秋林倦鳥歸 一路蕭蕭荒驛晚 野花香濺綠箕衣",
"賃舟遡刀水舟中" : "扁舟行盡幾波塘 滿岸新秋芳草長 一片離愁消不得 白蘋花底夢鵑娘",
"天明舟達三堀旗亭卽時" : "烟霧夢夢見不看 黎明人倚碧欄干 江村雨後加秋意 蕭瑟風吹簔草寒",
"客中憶家" : "北地天高露若霜 客心蟲語兩凄涼 寒砧和月秋千里 玉笛散風雁兩行 他國亂山愁外碧 故園落葉夢中黃 何當後苑閑吟句 幾處尋花徒繍牀",
"別後憶京中諸友" : "魂飛千里墨江湄 湄上晝樓楊柳枝 酒帶離愁醒更早 詩含別恨唱殊遲 銀紅照夢見蛾聚 素月匿秋知雨隨 料得洛陽才子伴 錦箋應寫斷腸詞",
"明治22年9月20日" : "抱劍聽龍鳴 讀書罵儒生 如今空高逸 入夢美人聲",
"明治43年7月31日" : "來宿山中寺 更加老衲衣 寂然禪夢底 窗外白雲歸",
"明治43年9月20日" : "大風鳴萬木 山雨搖高樓 病骨稜如劍 一燈靑慾愁",
"明治43年9月20日 2" : "秋風鳴萬木 山雨撼高樓 病骨稜如劍 一燈靑慾愁",
"明治43年9月22日" : "圓覺曾參文字禪 眉毛今日著前緣 靑山不拒庸人骨 卻下九原月在天",
"明治43年9月25日" : "風流人未死 病裡領淸閑 日日山中事 朝朝見碧山",
"明治43年9月29日" : "仰臥人如唖 默然見大空 大空雲不動 終日杳相同",
"明治43年10月1日" : "日似三春水 心隨野水空 牀頭花一片 閑落小眠中",
"明治43年10月2日" : "夢擁銀河白露流 夜分形影一燈愁 旗亭病近修禪寺 聽到晨鐘早上秋",
"明治43年10月2日 2" : "夢繞星潢泫露幽 夜分形影暗燈愁 旗亭病近修禪寺 一榥疎鐘已九秋",
"明治43年10月4日" : "萬事休時一息回 餘生豈忍比殘灰 風過古澗秋聲起 日落幽篁瞑色來 漫道山中三月滯 詎知門外一天開 歸期勿後黃花節 恐有羇魂夢舊苔",
"明治43年10月5日" : "淋漓絳血腹中文 嘔照黃昏漾綺紋 入夜空疑身是骨 臥牀如石夢寒雲",
"明治43年10月6日" : "天下自多事 被吹天下風 高秋悲鬢白 衰病夢顏紅 送鳥天無盡 看雲道不窮 殘存吾骨貴 愼勿妄磨瓏",
"明治43年10月7日" : "傷心秋已到 嘔血骨猶存 病起期何日 夕陽還一村",
"明治43年10月8日" : "秋露下南礀 黃花粲照顏 慾行沿澗遠 卻得與雲還",
"明治43年10月10日" : "客夢回時一鳥鳴 夜來山雨曉來晴 孤峯頂上孤松色 早映紅暾欝欝明",
"明治43年10月21日" : "吾失天時倂失愚 吾今會道道離吾 人閒忽盡聰明死 魔界猶存正義臞 擲地鏗鏘金錯劍 碎空燦爛夜光珠 獨呑涕淚長躊躇 怙恃兩亡立廣衢",
"明治43年10月25日" : "桃花馬上少年時 笑據銀鞍拂柳枝 綠水至今迢遞去 月明來照鬢如絲",
"明治43年10月27日" : "馬上靑年老 鏡中白髮新 幸生天子國 願作太平民",
"明治43年10月" : "縹渺玄黃外 死生交謝時 寄託冥然去 我心何所之 歸來覓命根 杳窅竟難知 孤愁空遶夢 宛動蕭瑟悲 江山秋已老 粥藥髩將衰 廓寥天尙在 高樹獨餘枝 晚懷如此澹 風露入詩遲", 
"明治43年10月池邊三山宛" : "遺卻新詩無處尋 嗒然隔牖對遙林 斜陽滿徑照僧遠 黃葉一村藏寺深 懸偈壁閒焚佛意 見雲天上抱琴心 人閒至樂江湖老 犬吠鷄鳴共好音",
"無題" : "眞蹤寂莫杳難尋 慾抱虛懷步古今 碧水碧山何有我 蓋天蓋地是無心 依稀暮色月離草 錯落秋聲風在林 眼耳雙忘身亦失 空中獨唱白雲吟",
"春日偶成其二" : "竹密能通水 花高不隱春 風光誰是主 好日屬詩人" ,
"無題" : "大愚難到志難成 五十春秋瞬息程 觀道無言只入靜 拈詩有句獨淸求 迢迢天外去雲影 籟籟風中 落葉聲 忽見閑窗虛白上 東山月出半江明",
"大正5年8月14日" : "幽居正解酒中忙 華髮何須住醉鄕 座有詩僧閑拈句 門無俗客靜焚香 花閒宿鳥振朝露 柳外歸牛帶夕陽 隨所隨緣淸興足 江村日月老來長",
"大正5年10月21日" : "吾失天時倂失愚 吾今會道道離吾 人閒忽盡聰明死 魔界猶存正義臞 擲地鏗鏘金錯劍 碎空燦爛夜光珠 獨呑涕淚長躊躇 怙恃兩亡立廣衢",
"大正5年11月20日" : "眞蹤寂莫杳難尋 慾抱虛懷步古今 碧水碧山何有我 蓋天蓋地是無心 依稀暮色月離草 錯落秋聲風在林 眼耳雙忘身亦失 空中獨唱白雲吟" },

"田中紀峰" : {
"孤客獨飮" : "白髮老翁猶慾娛 彷徨日暮窺酒舗 秋風未吹殘暑夜 獨客不得不感孤",
"病夫不能飮" : "竊羞病躯不能悅 不得不從醫師說 人皆飮醉又喫煙 只願我心安巡血",
"紫峰軒" : "山麓有桑田 鄕童采果食 酒家在路傍 孤客過休息",
"病中偶作" : "怏怏無聊病者憂 坊中起臥似俘囚 迎秋不覺秋風冷 窗外只看雲片流" }
}},

{"大正以降" : {
"大正天皇" : { // 1879 - 1926
"過目黑村" : "雨餘村落午風微 新綠陰中胡蝶飛 二樣芳香來撲鼻 焙茶氣雜野薔薇",
"梅雨" : "乍雨乍晴梅熟時 仰天偏願歲無飢 靑苗插遍水田裡 看到秋成始展眉",
"遠州洋上作" : "夜駕艨艟過遠州 滿天明月思悠悠 何時能遂平生志 一躍雄飛五大洲",
"葉山南園與韓國皇太子同看梅" : "不管春寒飛雪斜 喜君來訪暫停車 葉山歡會興何盡 共賞園梅幾樹花",
"秋夜讀書" : "秋夜漫漫意自如 西堂點滴雨聲疎 座中偏覺多涼氣 一穗燈光繙古書" },

"永井荷風" : { // 1879 - 1959
"墨上春遊" : "黃昏轉覺薄寒加 載酒又過江上家 十里珠簾二分月 一灣春水滿堤花",
"無題" : "書劍十年唯自憐 不如午夢伴花眠 靑雲有志歸虛願 羸得一囊詩酒錢" },

"李微" : {
"人虎傳" : "偶因狂疾成殊類 災患相仍不可逃 今日爪牙誰敢敵 當時聲蹟共相高 我爲異物蓬茅下 君已乘軺氣勢豪 此夕溪山對明月 不成長嘯但成嘷" },

"中島敦" : { // 1909 - 1942
"無題" : "習習東風夜淡晴 星光潤暈不鮮晶 淸明未到天狼沒 穀雨已過角宿瑩 庭上見星幽客意 花陰踏露惜春情 微芳滿地無人識 只有鄰家靜瑟聲",
"日曜所見" : "落葉空林徑 相逢碧眼孃 嬌嫣牽狗去 猶香素馨香",
"五月五日自哂戲作" : "行年三十一 狂生迎誕辰 木强嗤世事 狷介不交人 種花窮措大 書蠹病瘦身 不識天公意 何時免赤貧",
"無題2" : "攻文二十年 自嗤疎世事 夜偶倦繙書 起仰天狼熾",
"無題3" : "北辰何太廻 人事固堪嗤 莫嘆無知己 瞻星慾自怡",
"戲作" : "本牧花街晝寂寥 未粧商女卻嬌嬌 恨殺樓前流眄客 嚢裡胸中共蕭條" },

"田中角栄" : { // 1918 - 1993
"無題" : "國交途絕幾星霜 修交再開秋將到 鄰人眼溫吾人迎 北京空晴秋氣深" }
}}
];
